---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetEmissiveColor(Autodesk.Revit.DB.Color)
source: html/00b45e82-3bd5-b592-66e9-36364628c59b.htm
---
# Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetEmissiveColor Method

Sets the emissive color parameter of the effect instance.

## Syntax (C#)
```csharp
public void SetEmissiveColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - The emissive color value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null